Catalogs/РегламентированныеОтчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>РегламентированныеОтчеты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИсточникОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периоды</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийОтчетИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийОтчетХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийОтчетВерсия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УИДОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьНеПоказыватьВСписке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КешСхемЗвит1САктуален</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КешСхемЗвит1С</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяСхемыЗвит1С</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>8</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФормы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяОбласти</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ВнешниеРегламентированныеОтчетыВМоделиСервиса/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Обработчики получения поставляемых данных.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Регистрирует обработчики поставляемых данных за день и за все время
//
Процедура ЗарегистрироватьОбработчикиПоставляемыхДанных(Знач Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.ВидДанных = "ВнешнийРегламентированныйОтчет";
	Обработчик.КодОбработчика = "ВнешнийРегламентированныйОтчет";
	Обработчик.Обработчик = ВнешниеРегламентированныеОтчетыВМоделиСервиса;
	
КонецПроцедуры

// Вызывается при получении уведомления о новых данных.
// В теле следует проверить, необходимы ли эти данные приложению, 
// и если да - установить флажок Загружать
// 
// Параметры:
//   Дескриптор   - ОбъектXDTO Descriptor.
//   Загружать    - булево, возвращаемое
//
Процедура ДоступныНовыеДанные(Знач Дескриптор, Загружать) Экспорт
	
	Если Дескриптор.DataType = "ВнешнийРегламентированныйОтчет" Тогда
		
		Загружать = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается после вызова ДоступныНовыеДанные, позволяет разобрать данные.
//
// Параметры:
//   Дескриптор   - ОбъектXDTO Дескриптор.
//   ПутьКФайлу   - строка. Полное имя извлеченного файла. Файл будет автоматически удален 
//                  после завершения процедуры.
//
Процедура ОбработатьНовыеДанные(Знач Дескриптор, Знач ПутьКФайлу) Экспорт
	
	Если Дескриптор.DataType = "ВнешнийРегламентированныйОтчет"  Тогда
		
		ОбработатьВнРеглОтчет(Дескриптор, ПутьКФайлу);
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается при отмене обработки данных в случае сбоя
//
Процедура ОбработкаДанныхОтменена(Знач Дескриптор) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьИмяФайла(Знач ИмяФайла)
	
	Если ЭтоАдресВременногоХранилища(ИмяФайла) Тогда
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("zip");
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ИмяФайла);
		ДвоичныеДанные.Записать(ИмяВременногоФайла);
		РабИмяФайла = ИмяВременногоФайла;
	Иначе
		РабИмяФайла = ИмяФайла;
	КонецЕсли;
	
	Возврат РабИмяФайла;
	
КонецФункции

Функция ФайлОтчетаИзАрхива(КаталогРаспаковки)
	
	НайденныеФайлы = НайтиФайлы(КаталогРаспаковки, "*.erf", Ложь);
	Если НайденныеФайлы.Количество() = 0 Тогда
		ВызватьИсключение(НСтр("ru='Ошибка получения отчета. Архив не содержит файл с расширением ""*.erf"".';uk='Помилка отримання звіту. Архів не містить файл з розширенням ""*.erf"".'"));
	Иначе
		Возврат НайденныеФайлы[0];
	КонецЕсли;
	
КонецФункции

Процедура ОбработатьВнРеглОтчет(Дескриптор, ПутьКФайлу)
	
	ИмяВременногоФайла = ПолучитьИмяФайла(ПутьКФайлу);
	
	КаталогРаспаковки = ПолучитьИмяВременногоФайла();
	СоздатьКаталог(КаталогРаспаковки);
	
	Попытка
		
		Архиватор = Новый ЧтениеZipФайла(ИмяВременногоФайла);
		Архиватор.ИзвлечьВсе(КаталогРаспаковки);
		Архиватор.Закрыть();
		
		СистемнаяИнформация = Новый СистемнаяИнформация;
		ЭтоЛинукс =  СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86 ИЛИ СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64;
		КаталогРаспаковки = КаталогРаспаковки + ?(ЭтоЛинукс, "/", "\");
		
		Манифест = ПрочитатьМанифест(КаталогРаспаковки);
		
	Исключение
		
		ТекстОшибки = НСтр("ru='Не удалось распаковать архив с поставляемыми данными.';uk='Не вдалося розпакувати архів з даними, що постачаються.'");
		ЗаписатьВЖурналРегистрации(УровеньЖурналаРегистрации.Ошибка, ТекстОшибки);
		Возврат;
		
	КонецПопытки;
	
	// Проверка данных манифеста
	// Прочитать версию отчета
	ИДКонфигурации      = Манифест.ИДКонфигурации;
	ВерсияКонфигурации  = Манифест.ВерсияКонфигурации;
	ИсточникОтчета      = Манифест.ИсточникОтчета;
	Версия              = Манифест.Версия;
	Имя                 = Манифест.Имя;
	
	ВнешнийОтчетИспользовать = Манифест.ВнешнийОтчетИспользовать;
	Если Манифест.ВнешнийОтчетИспользовать = Неопределено Тогда
		ВнешнийОтчетИспользовать = Истина;
	ИначеЕсли ВРег(Манифест.ВнешнийОтчетИспользовать) = "FALSE"
		ИЛИ ВРег(Манифест.ВнешнийОтчетИспользовать) = "ЛОЖЬ"
		ИЛИ ВРег(Манифест.ВнешнийОтчетИспользовать) = "НЕТ" Тогда
		ВнешнийОтчетИспользовать = Ложь;
	Иначе
		ВнешнийОтчетИспользовать = Истина;
	КонецЕсли;
	
	СвойстваМанифеста = Новый Структура;
	СвойстваКонфигурации = Новый Структура;
	СвойстваОтчета = Новый Структура;
	
	СвойстваМанифеста.Вставить("ИДКонфигурации", ИДКонфигурации);
	СвойстваМанифеста.Вставить("ВерсияКонфигурации", ВерсияКонфигурации);
	СвойстваМанифеста.Вставить("ИсточникОтчета", ИсточникОтчета);
	СвойстваМанифеста.Вставить("КраткаяВерсияВнешнегоОтчета", ВерсияКонфигурации + "." + Версия);
	
	СвойстваКонфигурации.Вставить("ИДКонфигурации", РегламентированнаяОтчетностьПереопределяемый.ИДКонфигурации());
	СвойстваКонфигурации.Вставить("ВерсияКонфигурации", Метаданные.Версия);
	
	// 1) проверка на соответствие идентификатора конфигурации в отчете идентификатору текущей конфигурации
	Если СвойстваМанифеста["ИДКонфигурации"] <> СвойстваКонфигурации["ИДКонфигурации"] Тогда
		ТекстОшибки = НСтр("ru='Не пройдена проверка на соответствие идентификатора конфигурации в отчете идентификатору текущей конфигурации';uk='Не пройдена перевірка на відповідність ідентифікатора конфігурації в звіті ідентифікатору поточної конфігурації'");
		ЗаписатьВЖурналРегистрации(УровеньЖурналаРегистрации.Ошибка, ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	// 2) проверка на соответствие версии в отчете версии текущей конфигурации
	Если СвойстваМанифеста["ВерсияКонфигурации"] <> СвойстваКонфигурации["ВерсияКонфигурации"] Тогда
		ТекстОшибки = НСтр("ru='Не пройдена проверка на соответствие версии в отчете версии текущей конфигурации.';uk='Не пройдена перевірка на відповідність версії у звіті версії поточної конфігурації.'");
		ЗаписатьВЖурналРегистрации(УровеньЖурналаРегистрации.Ошибка, ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	// проверка на соответсвие параметров манифеста и конфигурации пройдена
	// проверка на соответствие имени метаданных отчета свойству ИсточникОтчета текущего элемента
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РегламентированныеОтчеты.Ссылка,
	               |	РегламентированныеОтчеты.ИсточникОтчета,
	               |	РегламентированныеОтчеты.ВнешнийОтчетИспользовать,
	               |	РегламентированныеОтчеты.ВнешнийОтчетВерсия
	               |ИЗ
	               |	Справочник.РегламентированныеОтчеты КАК РегламентированныеОтчеты
	               |ГДЕ
	               |	РегламентированныеОтчеты.Наименование = &Наименование
	               |	И РегламентированныеОтчеты.ИсточникОтчета = &ИсточникОтчета";
	Запрос.УстановитьПараметр("Наименование", Имя);
	Запрос.УстановитьПараметр("ИсточникОтчета", ИсточникОтчета);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		ТекстОшибки = НСтр("ru='Для внешнего отчета не найден соответствующий элемент.';uk='Для зовнішнього звіту не знайдений відповідний елемент.'");
		ЗаписатьВЖурналРегистрации(УровеньЖурналаРегистрации.Ошибка, ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	СвойстваКонфигурации.Вставить("ИсточникОтчета", Выборка.ИсточникОтчета);
	
	Если НЕ ВнешнийОтчетИспользовать Тогда 
		ОбъектСправочник = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектСправочник.ВнешнийОтчетИспользовать = Ложь;
		ОбъектСправочник.Записать();
		ТекстДляЖурнала = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Внешний отчет ""%1"" вер. ""%2"" отключен.';uk='Зовнішній звіт ""%1"" вер. ""%2"" відключений.'"), Имя, СвойстваМанифеста["КраткаяВерсияВнешнегоОтчета"]);
		ЗаписатьВЖурналРегистрации(УровеньЖурналаРегистрации.Информация, ТекстДляЖурнала);
		Возврат;
	КонецЕсли;
	
	ИспользуетсяВнешнийОтчет = Выборка.ВнешнийОтчетИспользовать;
	
	Если ИспользуетсяВнешнийОтчет Тогда
		
		СвойстваКонфигурации.Вставить("КраткаяВерсияВнешнегоОтчета", Выборка.ВнешнийОтчетВерсия);
		
		// 4) сравнение версий манифеста выбранного и хранимого отчетов
		РезультатСравнениеВерсийХранимогоИЗагружаемогоОтчетов = 
		РегламентированнаяОтчетностьКлиентСервер.СравнитьКраткиеВерсииОтчетов(СвойстваКонфигурации["КраткаяВерсияВнешнегоОтчета"],
			СвойстваМанифеста["КраткаяВерсияВнешнегоОтчета"]);
		Если РезультатСравнениеВерсийХранимогоИЗагружаемогоОтчетов  = -1 Тогда // если загружаемый отчет старее хранимого
			ТекстОшибки = НСтр("ru='Не пройдена проверка на сравнение версий манифеста выбранного и хранимого отчетов';uk='Не пройдена перевірка на порівняння версій маніфесту вибраного і збереженого звітів'");
			ЗаписатьВЖурналРегистрации(УровеньЖурналаРегистрации.Информация, ТекстОшибки);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Попытка
		
		ФайлОтчета = ФайлОтчетаИзАрхива(КаталогРаспаковки);
		
		ОбъектОтчет = ВнешниеОтчеты.Создать(ФайлОтчета.ПолноеИмя, Истина, ОбщегоНазначения.ОписаниеЗащитыБезПредупреждений());
		
		АдресФайлаВоВременномХранилище = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ФайлОтчета.ПолноеИмя), Новый УникальныйИдентификатор);
		
	Исключение
		
		ЗаписатьВЖурналРегистрации(УровеньЖурналаРегистрации.Ошибка, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
		
	КонецПопытки;
	
	ПолнаяВерсияВнешнегоОтчета = РегламентированнаяОтчетностьВызовСервера.ПолучитьВерсиюРегламентированногоОтчета(ОбъектОтчет);
	СвойстваПолнойВерсии = РегламентированнаяОтчетностьВызовСервера.РазложитьПолнуюВерсиюРегламентированногоОтчета(ПолнаяВерсияВнешнегоОтчета);
	
	СвойстваОтчета.Вставить("ИДКонфигурации", СвойстваПолнойВерсии.ИДКонфигурации);
	СвойстваОтчета.Вставить("ВерсияКонфигурации", СвойстваПолнойВерсии.ВерсияКонфигурации);
	СвойстваОтчета.Вставить("ИсточникОтчета", ОбъектОтчет.Метаданные().Имя);
	СвойстваОтчета.Вставить("КраткаяВерсияВнешнегоОтчета", СвойстваПолнойВерсии.КраткаяВерсия);
	
	// проверка на соответствие идентификатора конфигурации в отчете идентификатору конфигурации в текущем подключенном отчете
	Если СвойстваКонфигурации["ИДКонфигурации"] <> СвойстваОтчета["ИДКонфигурации"] Тогда
		ТекстОшибки = НСтр("ru='Не пройдена проверка на соответствие идентификатора конфигурации в отчете идентификатору конфигурации в текущем подключенном отчете';uk='Не пройдена перевірка на відповідність ідентифікатора конфігурації в звіті ідентифікатору конфігурації в поточному підключеному звіті'");
		ЗаписатьВЖурналРегистрации(УровеньЖурналаРегистрации.Ошибка, ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	// проверка на соответствие версии в отчете версии в текущем подключенном отчете, при условии, что подключен внешний
	Если ИспользуетсяВнешнийОтчет Тогда
		Если СвойстваОтчета["ВерсияКонфигурации"] <> СвойстваКонфигурации["ВерсияКонфигурации"] Тогда
			ТекстОшибки = НСтр("ru='Не пройдена проверка на соответствие версии в отчете версии в текущем подключенном отчете';uk='Не пройдена перевірка на відповідність версії у звіті версії в поточному підключеному звіті'");
			ЗаписатьВЖурналРегистрации(УровеньЖурналаРегистрации.Ошибка, ТекстОшибки);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// проверка на соответствие имени метаданных отчета имени метаданных текущего подключенного отчета
	Если СвойстваОтчета["ИсточникОтчета"] <> СвойстваКонфигурации["ИсточникОтчета"] Тогда
		ТекстОшибки = НСтр("ru='Не пройдена проверка на имени метаданных отчета имени метаданных текущего подключенного отчета';uk='Не пройдена перевірка на імені метаданих звіту імені метаданих поточного підключеного звіту'");
		ЗаписатьВЖурналРегистрации(УровеньЖурналаРегистрации.Ошибка, ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	// сравнение версий выбранного и хранимого отчетов, при условии, что подключен внешний
	Если ИспользуетсяВнешнийОтчет Тогда
		РезультатСравнениеВерсийХранимогоИЗагружаемогоОтчетов = 
		РегламентированнаяОтчетностьКлиентСервер.СравнитьКраткиеВерсииОтчетов(СвойстваКонфигурации["КраткаяВерсияВнешнегоОтчета"], 
		СвойстваОтчета["КраткаяВерсияВнешнегоОтчета"]);
		Если РезультатСравнениеВерсийХранимогоИЗагружаемогоОтчетов  = -1 Тогда // если загружаемый отчет старее хранимого
			ТекстОшибки = НСтр("ru='Не пройдена проверка на сравнение версий выбранного и хранимого отчетов';uk='Не пройдена перевірка на порівняння версій вибраного і збереженого звітів'");
			ЗаписатьВЖурналРегистрации(УровеньЖурналаРегистрации.Ошибка, ТекстОшибки);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// Проверка пройдена успешно, загружаем отчет в ИБ
	Попытка
		ОбъектСправочник = Выборка.Ссылка.ПолучитьОбъект();
	Исключение
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Получение объекта отчета по ссылке из выборки.
|Описание:
|""%1""'
|;uk='Отримання об''єкта звіту за посиланням з вибірки.
|Опис:
|""%1""'"), ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписатьВЖурналРегистрации(УровеньЖурналаРегистрации.Ошибка, ТекстОшибки);
		Возврат;
	КонецПопытки;
	
	Попытка
		
		ОбъектСправочник.ВнешнийОтчетИспользовать = Истина;
		
		ОбъектСправочник.ВнешнийОтчетХранилище = 
			Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресФайлаВоВременномХранилище), Новый СжатиеДанных(9));
		
		ОбъектСправочник.ВнешнийОтчетВерсия = СвойстваОтчета["КраткаяВерсияВнешнегоОтчета"];
		ОбъектСправочник.Записать();
		
		ТекстИнформации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Внешний отчет вер. ""%1"" успешно загружен.';uk='Зовнішній звіт вер. ""%1"" успішно завантажений.'"), СвойстваОтчета["КраткаяВерсияВнешнегоОтчета"]);
		
		ЗаписатьВЖурналРегистрации(УровеньЖурналаРегистрации.Информация, ТекстИнформации);
		
	Исключение
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Запись объекта отчета с новыми данными.
|Описание:
|""%1""'
|;uk='Запис об''єкта звіту з новими даними.
|Опис:
|""%1""'"), ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписатьВЖурналРегистрации(УровеньЖурналаРегистрации.Ошибка, ТекстОшибки);
		
	КонецПопытки;
	
	Попытка
		УдалитьФайлы(КаталогРаспаковки);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Функция ПрочитатьМанифест(КаталогРаспаковки)
	
	ФайлМанифеста = КаталогРаспаковки + "ExternalManifest.xml";
	Чтение = Новый ЧтениеXML;
	Чтение.ОткрытьФайл(ФайлМанифеста);
	Чтение.ПерейтиКСодержимому();
	
	Если Чтение.ТипУзла <> ТипУзлаXML.НачалоЭлемента ИЛИ Чтение.Имя <> "Info" Тогда
		ВызватьИсключение(НСтр("ru='Ошибка чтения XML. Неверный формат файла. Ожидается начало элемента Info.';uk='Помилка читання XML. Неправильний формат файлу. Очікується початок елемента Info.'"));
	КонецЕсли;
	
	Если НЕ Чтение.Прочитать() Тогда
		ВызватьИсключение(НСтр("ru='Ошибка чтения XML. Обнаружено завершение файла.';uk='Помилка читання XML. Виявлено завершення файлу.'"));
	КонецЕсли;
	
	Манифест = Новый Структура;
	
	ПостроительDOM = Новый ПостроительDOM;
	ДокументDOM = ПостроительDOM.Прочитать(Чтение);
	ТекстЗапроса = "//ns:ExternalReport";
	ВыражениеXPath = ДокументDOM.СоздатьВыражениеXPath(ТекстЗапроса,
		Новый РазыменовательПространствИменDOM("ns", "http://www.1c.ru/SaaS/ExternalReports"));
	РезультатXPath = ВыражениеXPath.Вычислить(ДокументDOM);
	УзелDOM = РезультатXPath.ПолучитьСледующий();
	Если УзелDOM <> Неопределено Тогда
		УзлыМанифеста = УзелDOM.ДочерниеУзлы;
		Для Каждого УзелМанифеста Из УзлыМанифеста Цикл
			Манифест.Вставить(УзелМанифеста.ИмяЭлемента, УзелМанифеста.ТекстовоеСодержимое);
		КонецЦикла;
	КонецЕсли;
	
	Чтение.Закрыть();
	
	Возврат ПроверитьМанифест(Манифест);
	
КонецФункции

Функция ПроверитьМанифест(Манифест)
	
	Если НЕ Манифест.Свойство("ИДКонфигурации") Тогда
		Манифест.Вставить("ИДКонфигурации", "");
	КонецЕсли;
	Если НЕ Манифест.Свойство("ВерсияКонфигурации") Тогда
		Манифест.Вставить("ВерсияКонфигурации", "");
	КонецЕсли;
	Если НЕ Манифест.Свойство("ИсточникОтчета") Тогда
		Манифест.Вставить("ИсточникОтчета", "");
	КонецЕсли;
	Если НЕ Манифест.Свойство("Версия") Тогда
		Манифест.Вставить("Версия", "");
	КонецЕсли;
	Если НЕ Манифест.Свойство("Имя") Тогда
		Манифест.Вставить("Имя", "");
	КонецЕсли;
	Если НЕ Манифест.Свойство("ВнешнийОтчетИспользовать") Тогда
		Манифест.Вставить("ВнешнийОтчетИспользовать", "true");
	КонецЕсли;
	
	Возврат Манифест;
	
КонецФункции

Процедура ЗаписатьВЖурналРегистрации(Уровень, ТекстОшибки)
	
	ЗаписьЖурналаРегистрации(ИмяСобытияВЖурналеРегистрации(), Уровень,,, ТекстОшибки);
	
КонецПроцедуры

Функция ИмяСобытияВЖурналеРегистрации()
	
	Возврат НСтр("ru='Поставляемые данные.Загрузка внешних регламентированных отчетов';uk='Дані, що поставляються.Завантаження зовнішніх регламентованих звітів'");
	
КонецФункции

#КонецОбласти
